## Plan Result (stg)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 0 to change, 5 to destroy.</code></pre>

* Replace
  * azurerm_resource_group.this
  * azurerm_service_plan.this
  * azurerm_storage_account.this
  * azurerm_windows_function_app.this
  * module.application_insights.azurerm_application_insights.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.this must be replaced
-/+ resource "azurerm_resource_group" "this" {
      ~ id       = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/alerts-slack-stg" -> (known after apply)
      ~ name     = "alerts-slack-stg" -> "alerts-slack-aat" # forces replacement
        tags     = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-alert-to-slack-function"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_service_plan.this must be replaced
-/+ resource "azurerm_service_plan" "this" {
      ~ id                           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/alerts-slack-stg/providers/Microsoft.Web/serverFarms/alerts-slack-stg" -> (known after apply)
      ~ kind                         = "functionapp" -> (known after apply)
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
      ~ name                         = "alerts-slack-stg" -> "alerts-slack-aat" # forces replacement
      ~ reserved                     = false -> (known after apply)
      ~ resource_group_name          = "alerts-slack-stg" -> "alerts-slack-aat" # forces replacement
        tags                         = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-alert-to-slack-function"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
      ~ worker_count                 = 0 -> (known after apply)
      - zone_balancing_enabled       = false -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_storage_account.this must be replaced
-/+ resource "azurerm_storage_account" "this" {
      ~ access_tier                        = "Hot" -> (known after apply)
      ~ id                                 = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/alerts-slack-stg/providers/Microsoft.Storage/storageAccounts/alertsslackstg" -> (known after apply)
      + large_file_share_enabled           = (known after apply)
      ~ name                               = "alertsslackstg" -> "alertsslackaat" # forces replacement
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://alertsslackstg.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "alertsslackstg.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://alertsslackstg.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "alertsslackstg.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://alertsslackstg.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "alertsslackstg.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "uksouth" -> (known after apply)
      ~ primary_queue_endpoint             = "https://alertsslackstg.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "alertsslackstg.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://alertsslackstg.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "alertsslackstg.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://alertsslackstg.z33.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "alertsslackstg.z33.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ resource_group_name                = "alerts-slack-stg" -> "alerts-slack-aat" # forces replacement
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
        tags                               = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-alert-to-slack-function"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (17 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
            ] -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # azurerm_windows_function_app.this must be replaced
-/+ resource "azurerm_windows_function_app" "this" {
      ~ custom_domain_verification_id                  = (sensitive value)
      ~ default_hostname                               = "alerts-slack-stg.azurewebsites.net" -> (known after apply)
      + hosting_environment_id                         = (known after apply)
      ~ https_only                                     = false -> (known after apply)
      ~ id                                             = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/alerts-slack-stg/providers/Microsoft.Web/sites/alerts-slack-stg" -> (known after apply)
      ~ key_vault_reference_identity_id                = "SystemAssigned" -> (known after apply)
      ~ kind                                           = "functionapp" -> (known after apply)
      ~ name                                           = "alerts-slack-stg" -> "alerts-slack-aat" # forces replacement
      ~ outbound_ip_address_list                       = [
          - "20.90.197.39",
          - "20.90.197.56",
          - "20.90.197.252",
          - "20.90.198.215",
          - "20.90.199.140",
          - "20.90.199.179",
          - "20.90.134.0",
        ] -> (known after apply)
      ~ outbound_ip_addresses                          = "20.90.197.39,20.90.197.56,20.90.197.252,20.90.198.215,20.90.199.140,20.90.199.179,20.90.134.0" -> (known after apply)
      ~ possible_outbound_ip_address_list              = [
          - "20.90.197.39",
          - "20.90.197.56",
          - "20.90.197.252",
          - "20.90.198.215",
          - "20.90.199.140",
          - "20.90.199.179",
          - "20.108.112.170",
          - "20.108.113.91",
          - "20.108.117.43",
          - "20.108.117.60",
          - "20.108.117.65",
          - "20.108.117.66",
          - "20.108.112.6",
          - "20.108.117.85",
          - "20.108.117.73",
          - "20.108.112.211",
          - "20.108.117.79",
          - "20.108.117.164",
          - "20.108.117.86",
          - "20.108.117.103",
          - "20.108.117.131",
          - "20.108.118.71",
          - "20.108.117.122",
          - "20.108.118.75",
          - "20.108.117.152",
          - "20.108.118.78",
          - "20.108.118.128",
          - "20.108.118.150",
          - "20.108.118.181",
          - "20.108.118.211",
          - "20.90.134.0",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses                 = "20.90.197.39,20.90.197.56,20.90.197.252,20.90.198.215,20.90.199.140,20.90.199.179,20.108.112.170,20.108.113.91,20.108.117.43,20.108.117.60,20.108.117.65,20.108.117.66,20.108.112.6,20.108.117.85,20.108.117.73,20.108.112.211,20.108.117.79,20.108.117.164,20.108.117.86,20.108.117.103,20.108.117.131,20.108.118.71,20.108.117.122,20.108.118.75,20.108.117.152,20.108.118.78,20.108.118.128,20.108.118.150,20.108.118.181,20.108.118.211,20.90.134.0" -> (known after apply)
      ~ resource_group_name                            = "alerts-slack-stg" -> "alerts-slack-aat" # forces replacement
      ~ service_plan_id                                = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/alerts-slack-stg/providers/Microsoft.Web/serverFarms/alerts-slack-stg" -> (known after apply)
      ~ site_credential                                = (sensitive value)
      ~ storage_account_access_key                     = (sensitive value)
      ~ storage_account_name                           = "alertsslackstg" -> "alertsslackaat"
        tags                                           = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-alert-to-slack-function"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
      + zip_deploy_file                                = (known after apply)
        # (13 unchanged attributes hidden)

      ~ site_config {
          ~ always_on                              = false -> (known after apply)
          ~ app_scale_limit                        = 200 -> (known after apply)
          ~ application_insights_connection_string = (sensitive value)
          ~ default_documents                      = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled         = false -> (known after apply)
          ~ elastic_instance_minimum               = 0 -> (known after apply)
          ~ health_check_eviction_time_in_min      = 0 -> (known after apply)
          ~ pre_warmed_instance_count              = 0 -> (known after apply)
          + remote_debugging_version               = (known after apply)
          - runtime_scale_monitoring_enabled       = false -> null
          ~ scm_type                               = "None" -> (known after apply)
          + windows_fx_version                     = (known after apply)
          ~ worker_count                           = 1 -> (known after apply)
            # (11 unchanged attributes hidden)

          ~ application_stack {
              ~ use_custom_runtime          = false -> (known after apply)
              ~ use_dotnet_isolated_runtime = false -> (known after apply)
                # (2 unchanged attributes hidden)
            }
        }
    }

  # module.application_insights.azurerm_application_insights.this must be replaced
-/+ resource "azurerm_application_insights" "this" {
      ~ app_id                                = "ebee1b06-8a5f-4c90-9ec5-e22be4e160b3" -> (known after apply)
      ~ connection_string                     = (sensitive value)
      ~ daily_data_cap_notifications_disabled = false -> (known after apply)
      ~ id                                    = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/alerts-slack-stg/providers/Microsoft.Insights/components/alerts-aat" -> (known after apply)
      ~ instrumentation_key                   = (sensitive value)
        name                                  = "alerts-aat"
      ~ resource_group_name                   = "alerts-slack-stg" -> "alerts-slack-aat" # forces replacement
        tags                                  = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-alert-to-slack-function"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (11 unchanged attributes hidden)
    }

Plan: 5 to add, 0 to change, 5 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":10,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->